# Working with Real Data

In [1]:
import pandas as pd
import numpy as np
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/haven-jeon/introduction_to_most_usable_pkgs_in_project/master/bicdata/data/titanic.csv")

In [3]:
df.head(3)

,Unnamed: 0,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1st,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.337494,B5,Southampton,2,NaN,"St Louis, MO"
1,2,1st,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.550003,C22 C26,Southampton,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1st,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.550003,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON"

##remove missing values:
* for numeric values, replace them with the mean
* for categorical values, replace them with 'NA'
* remove the variables 'body' and 'boat', with too much missing values

In [4]:
df.fillna(df.mean(),inplace=True) # remplace toutes les NaN par la moyenne de la colonne, pour les variables numériques
df[['cabin','home.dest','body','boat']] = df[['cabin','home.dest','body','boat']].fillna('NA')
df.drop(['Unnamed: 0','name','body','boat','ticket'],axis=1,inplace=True)
df.head(3)

,pclass,survived,sex,age,sibsp,parch,fare,cabin,embarked,home.dest
0,1st,1,female,29.0000,0,0,211.337494,B5,Southampton,"St Louis, MO"
1,1st,1,male,0.9167,1,2,151.550003,C22 C26,Southampton,"Montreal, PQ / Chesterville, ON"
2,1st,0,female,2.0000,1,2,151.550003,C22 C26,Southampton,"Montreal, PQ / Chesterville, ON"

In [7]:
for i in df:
    print i , ":" , df[i].dtypes,"  , it has " , len(df[i].unique()) ," distinct values"

 pclass : object   , it has  3  distinct values
survived : int64   , it has  2  distinct values
sex : object   , it has  2  distinct values
age : float64   , it has  99  distinct values
sibsp : int64   , it has  7  distinct values
parch : int64   , it has  8  distinct values
fare : float64   , it has  282  distinct values
cabin : object   , it has  187  distinct values
embarked : object   , it has  4  distinct values
home.dest : object   , it has  369  distinct values

In [9]:
df.drop(['home.dest'],axis=1,inplace=True)

##convert the categorical variable into a numeric variable

To convert categorical variables with plenty of values into numerical variables, we need to create new variables.

In [13]:
L = pd.Series(['a','b','c','a'])
L

0    a
1    b
2    c
3    a
dtype: object

In [14]:
pd.get_dummies(L)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [15]:
def catToNum(dat,atts,drop=True):
    for j in atts:
        dfbin = pd.get_dummies(dat[j])
        for k in dfbin:
            dat[j+'_'+k] = dfbin[k]
    if drop:
        dat.drop(atts,axis=1,inplace=True)
    return dat

In [16]:
df = catToNum(df,['sex','pclass','cabin','embarked'],drop=False)
df.head(3).iloc[0]
df.pclass = df.pclass_1st + 2*df.pclass_2nd + 3*df.pclass_3rd

In [17]:
df.head(3)

,pclass,survived,sex,age,sibsp,parch,fare,cabin,embarked,sex_female,...,cabin_F2,cabin_F33,cabin_F38,cabin_F4,cabin_G6,cabin_NA,cabin_T,embarked_Cherbourg,embarked_Queenstown,embarked_Southampton
0,1,1,female,29.0000,0,0,211.337494,B5,Southampton,1,...,0,0,0,0,0,0,0,0,0,1
1,1,1,male,0.9167,1,2,151.550003,C22 C26,Southampton,0,...,0,0,0,0,0,0,0,0,0,1
2,1,0,female,2.0000,1,2,151.550003,C22 C26,Southampton,1,...,0,0,0,0,0,0,0,0,0,1

In [ ]:
df.to_csv("clean_titanic.csv")